testing_cases/aerosolsTransmissionChen_QMOM/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.225 0 0);
        /*
        type                uniformFixedValue;
        uniformValue  tableFile;
        uniformValueCoeffs
        {
            file                "$FOAM_CASE/sneezeVelocity";    // name of data file
            format              foam;        // data format (optional)
            outOfBounds         clamp;       // optional out-of-bounds handling
            interpolationScheme linear;      // optional interpolation method
            //nHeaderLine         0;          // number of header lines
	    //refColumn           0;          // reference column index
	    //componentColumns    1;    // component column indices
            //separator           ",";        // optional (defaults to ",")
	     //mergeSeparators     no;         // merge multiple separators
        }
        */
        
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           $internalField;
    }
    leftWalls
    {
        type            noSlip;
    }
    middleWalls
    {
        type            noSlip;
    }
    rightWalls
    {
        type            noSlip;
    }
    front
    {
        type            symmetryPlane;
    }
  
}

// ************************************************************************* //
