testing_cases/aerosolsTransmissionChen_QMOM/0/epsilon.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.23e-6;
        /*
        type                uniformFixedValue;
        uniformValue  tableFile;
        uniformValueCoeffs
        {
            file                "$FOAM_CASE/sneezeEpsilon";    // name of data file
            format              foam;        // data format (optional)
            outOfBounds         clamp;       // optional out-of-bounds handling
            interpolationScheme linear;      // optional interpolation method
            //nHeaderLine         0;          // number of header lines
	    //refColumn           0;          // reference column index
	    //componentColumns    1;    // component column indices
            //separator           ",";        // optional (defaults to ",")
	     //mergeSeparators     no;         // merge multiple separators
        }
        */
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
        value           $internalField;
    }
    leftWalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    middleWalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    rightWalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    front
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
