testing_cases/aerosolsTransmissionChen_QMOM/0/moment.3.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      moment.3.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        //value           uniform 4.43660319E-04;
        //value           uniform 1.909859E-08;
        value           uniform 9.549295E-08;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 0;
        value           uniform 0;
    }
    leftWalls
    {
        type            zeroGradient;
    }
    middleWalls
    {
        type            zeroGradient;
    }
    rightWalls
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
