testing_cases/aerosolsTransmissionChen_QMOM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 101325;

boundaryField
{
    inlet
    {
        type               calculated;
        value              $internalField;
    }
    outlet
    {
        type               calculated;
        value              $internalField;
    }  
    leftWalls
    {
        type               calculated;
        value              $internalField;
    }
    middleWalls
    {
        type               calculated;
        value              $internalField;
    }
    rightWalls
    {
        type               calculated;
        value              $internalField;
    }
    front
    {
        type            symmetryPlane;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
