testing_cases/aerosolsTransmissionChen_QMOM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 101325;

boundaryField
{
    inlet
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    outlet
    {
    /*
        type               prghTotalPressure;
        p0                 $internalField;
        U                  U.gas;
        phi                phi.gas;
        rho                thermo:rho.gas;
        value              $internalField;
        */
        type               fixedValue;
        value              $internalField;
    }    
    leftWalls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    middleWalls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    rightWalls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    front
    {
        type            symmetryPlane;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
