testing_cases/aerosolsTransmissionChen_QMOM/constant/quadratureProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion    basicFieldMomentInversion;

basicMomentInversion
{
    univariateMomentInversion   Gauss;
    smallM0                     1e-8;
}

moments
(
    (0)
    (1)
    (2)
    (3)
    //(4)
);

nodes
(
    (0)
    (1)
);

residuals
{
    minM0   1e-8;
    minM1   1e-10;
}

// ************************************************************************* //
