testing_cases/aerosolsTransmissionChen_QMOM/constant/turbulenceProperties.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//simulationType  laminar;

simulationType  RAS;

RAS
{
    RASModel RNGkEpsilon;

    turbulence      on;
    printCoeffs     on;
    
}
/*
    mixtureKEpsilonCoeffs
    {
        Cp  0;
        C3  0;
    }
*/


/*
simulationType  LES;

RAS
{
    RASModel mixtureKEpsilon;

    turbulence      on;
    printCoeffs     on;

    mixtureKEpsilonCoeffs
    {
        Cp  0;
        C3  0;
    }
}
LES
{
    LESModel Smagorinsky;

    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
    }
}
*/
// ************************************************************************* //
