testing_cases/aerosolsTransmissionChen_QMOM/system/controlDict2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     monodisperseDropletFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         150;
//endTime         0.031;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1.0e-3;

functions
{
/*
    fieldAverage1
    {
        type            fieldAverage;
        libs            (libfieldFunctionObjects);
        writeControl    outputTime;
        timeStart       5;
        fields
        (
            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            d.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
    #includeFunc writeObjects(corr)
    #includeFunc writeObjects(Kh.gas)
    #includeFunc writeObjects(Kh.liquid)
    */
    //#includeFunc writeObjects(dsm)
    //#includeFunc writeObjects(dvdtf)
    //#includeFunc fieldMinMax
    
    fileUpdate1
{
    type              timeActivatedFileUpdate;
    libs              (utilityFunctionObjects);
    writeControl      timeStep;
    writeInterval     1;
    fileToUpdate      "$FOAM_CASE/system/controlDict";
    timeVsFile
    (
        (-1   "$FOAM_CASE/system/controlDict1")
        (60.0  "$FOAM_CASE/system/controlDict2")
        (80.0  "$FOAM_CASE/system/controlDict3")
        
        
        //(0.02  "$FOAM_CASE/system/controlDict2")
        //(0.03  "$FOAM_CASE/system/controlDict3")
        
    );
}
}


// ************************************************************************* //
