testing_cases/aerosolsTransmissionChen_QMOM/system/fieldMinMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            fieldMinMax;
libs            ("libfieldFunctionObjects.so");

writeControl    timeStep;

log             yes;
location        yes;
mode            magnitude;
fields
(
    dsm
);

// ************************************************************************* //
