testing_cases/aerosolsTransmissionChen_QMOM/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitTemperatureGas
{
	type            limitTemperature;
                min             273.15;
                max            400;
                phase          gas;
                selectionMode  all;
}

limitTemperatureLiquid
{
	type            limitTemperature;
                min             273.15;
                max            400;
                phase          liquid;
                selectionMode  all;
}


// ************************************************************************* //
